### 1.1 경량 DBMS
- 별도의 서버가 필요 없음
- 모바일 기기에서 많이 활용되고 있음
- 파이썬3에 기본 내장되어 있음
- 파일 또는 메모리에 DB 생성
- 참고자료: SQLite로 가볍게 배우는 데이터베이스 (WikiDocs)

### 1.2 데이터 타입
- 동적 데이터 타입
- Null, Integer, Real, Text, Blob 유형이 있음 (Boolean, Date, Time 없음)
- 다른 유형 데이터를 삽입해도 컬럼에 맞게 알아서 들어감.
- 다른 DB에서 사용하는 데이터유형 이름 그대로 사용해도 무방

In [45]:
import sqlite3

In [70]:
conn = sqlite3.connect('./test.db') 
'''
conn = sqlite3.connect(':memory:')    # 메모리 DB 접속(일회성)
'''

"\nconn = sqlite3.connect(':memory:')    # 메모리 DB 접속(일회성)\n"

In [47]:
cur = conn.cursor()

In [6]:
cur.execute('CREATE TABLE IF NOT EXISTS Eagles \
    (back_no INT NOT NULL, \
     name TEXT, \
     position TEXT, \
     hands TEXT, \
     highschool TEXT, \
     height INT, \
     PRIMARY KEY(back_no));')

In [4]:
cur.execute('DROP TABLE Eagles')

In [7]:
cur = conn.cursor()
cur.execute("INSERT INTO Eagles('back_no', 'name', 'position') \
             VALUES (30, '호잉', '외야수');")

In [8]:
conn.commit()

In [9]:
cur = conn.cursor()
cur.execute("INSERT INTO Eagles VALUES \
    (1, '하주석', '내야수', '우투좌타', '신일고', 184), \
    (28, '양성우', '외야수', '우투좌타', '충암고', 177);")

In [10]:
conn.commit()

In [11]:
import pandas as pd
players = pd.read_csv('data/players.csv', encoding='EUC-KR')
players

   back_no name position hands highschool  height
0       17  김범수       투수  좌투좌타      천안북일고     181
1       38  안영명       투수  우투우타      천안북일고     183
2       36  장민재       투수  우투우타      광주제일고     184
3       13  최재훈       포수  우투우타        덕수고     178
4       52  김태균      내야수  우투우타      천안북일고     185
5        7  송광민      내야수  우투우타        공주고     184
6       50  이성열      내야수  우투좌타      순천효천고     185
7       43  정은원      내야수  우투좌타        인천고     177
8        8  정근우      외야수  우투우타        부산고     172
9       25  최진행      외야수  우투우타      덕수정보고     188

In [12]:
cur = conn.cursor()
sql = 'INSERT INTO Eagles VALUES (?, ?, ?, ?, ?, ?);'
for i in range(10):
    cur.execute(sql, (int(players.iloc[i,0]), 
                      players.iloc[i,1], players.iloc[i,2], 
                      players.iloc[i,3], players.iloc[i,4], 
                      int(players.iloc[i,5])))
conn.commit()

In [13]:
# 순회 조회
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles')
for row in cur:
    print(row)

(30, '호잉', '외야수', None, None, None)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)
(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)

In [20]:
# 단건 조회
cur = conn.cursor()
cur.execute("SELECT * FROM Eagles")
row = cur.fetchone()
print(row)

(30, '호잉', '외야수', None, None, None)

In [21]:
# 다건 조회
rows = cur.fetchmany(2)
for row in rows:
    print(row)

(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)

In [22]:
# 모두 조회
rows = cur.fetchall()
for row in rows:
    print(row)

(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)

In [23]:
# 필요한 column만 조회, 조회 조건도 추가
cur = conn.cursor()
cur.execute('SELECT name FROM Eagles WHERE back_no > 30')
rows = cur.fetchall();
for row in rows:
    print(row)

('장민재',)
('안영명',)
('정은원',)
('이성열',)
('김태균',)

In [24]:
# 조회 조건
cur = conn.cursor()
cur.execute("SELECT * FROM Eagles WHERE position like '내야수'")
rows = cur.fetchall();
for row in rows:
    print(row)

(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)

In [25]:
# 원하는 순서
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles ORDER BY height DESC')
rows = cur.fetchall();
for row in rows:
    print(row)

(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(7, '송광민', '내야수', '우투우타', '공주고', 184)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(13, '최재훈', '포수', '우투우타', '덕수고', 178)
(28, '양성우', '외야수', '우투좌타', '충암고', 177)
(43, '정은원', '내야수', '우투좌타', '인천고', 177)
(8, '정근우', '외야수', '우투우타', '부산고', 172)
(30, '호잉', '외야수', None, None, None)

In [27]:
# 원하는 순서 및 갯수
cur = conn.cursor()
cur.execute('SELECT * FROM Eagles ORDER BY height DESC LIMIT 5')
rows = cur.fetchall();
for row in rows:
    print(row)

(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(1, '하주석', '내야수', '우투좌타', '신일고', 184)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)

In [28]:
# 집계 함수
cur.execute('SELECT count(*) FROM Eagles')
count = cur.fetchone()
print(count)

(13,)

In [29]:
# 그룹핑, 집계 함수
cur = conn.cursor()
cur.execute('SELECT position, count(*), avg(height) FROM Eagles GROUP BY position')
rows = cur.fetchall();
for row in rows:
    print(row)

('내야수', 5, 183.0)
('외야수', 4, 179.0)
('투수', 3, 182.66666666666666)
('포수', 1, 178.0)

In [30]:
# Placeholder를 사용해서 데이터 검색
cur = conn.cursor()
back_no = 50
cur.execute('SELECT * FROM Eagles WHERE back_no=?;', (back_no,))
player = cur.fetchone()
print(player)

(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)

In [48]:
# Placeholder를 사용해서 데이터 검색
cur = conn.cursor()
back_no = 10
height = 180
cur.execute('SELECT * FROM Eagles WHERE back_no > ? AND height > ?;', (back_no, height))
rows = cur.fetchall()
for row in rows:
    print(row)

(17, '김범수', '투수', '좌투좌타', '천안북일고', 181)
(25, '최진행', '외야수', '우투우타', '덕수정보고', 188)
(30, '호잉', '외야수', '우투좌타', '미쿡고', 190)
(36, '장민재', '투수', '우투우타', '광주제일고', 184)
(38, '안영명', '투수', '우투우타', '천안북일고', 183)
(50, '이성열', '내야수', '우투좌타', '순천효천고', 185)
(52, '김태균', '내야수', '우투우타', '천안북일고', 185)

In [31]:
cur = conn.cursor()
cur.execute("UPDATE Eagles SET hands='우투좌타', highschool='미쿡고', \
             height=190 WHERE back_no=30;")
conn.commit()

In [32]:
cur = conn.cursor()
cur.execute("DELETE FROM Eagles WHERE back_no=1;")
conn.commit()

In [33]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Stats \
    (id INT NOT NULL, \
     player TEXT, \
     average REAL, \
     rbi INT, \
     homerun INT, \
     PRIMARY KEY(id));')

In [34]:
stats = pd.read_csv('data/stats.csv', encoding='EUC-KR')
stats

  player  average  rbi  homerun
0     호잉    0.288   58       15
1    양성우    0.176    6        1
2    최재훈    0.300   23        2
3    김태균    0.308   43        5
4    송광민    0.257   39        6
5    이성열    0.255   62       18
6    정은원    0.281   47        5
7    정근우    0.219   10        2
8    최진행    0.184   14        3

In [35]:
cur = conn.cursor()
sql = 'INSERT INTO Stats VALUES (?, ?, ?, ?, ?);'
for i in range(9):
    cur.execute(sql, (i+1, 
                      stats.iloc[i,0],
                      float(stats.iloc[i,1]), 
                      int(stats.iloc[i,2]),
                      int(stats.iloc[i,3])))
conn.commit()

In [36]:
cur = conn.cursor()
cur.execute('SELECT * FROM Stats')
for row in cur:
    print(row)

(1, '호잉', 0.28800000000000003, 58, 15)
(2, '양성우', 0.17600000000000002, 6, 1)
(3, '최재훈', 0.3, 23, 2)
(4, '김태균', 0.308, 43, 5)
(5, '송광민', 0.257, 39, 6)
(6, '이성열', 0.255, 62, 18)
(7, '정은원', 0.281, 47, 5)
(8, '정근우', 0.21899999999999997, 10, 2)
(9, '최진행', 0.184, 14, 3)

In [37]:
sql = "SELECT Eagles.back_no, Eagles.name, Eagles.position, \
           Stats.average, Stats.rbi, Stats.homerun \
           FROM Eagles JOIN Stats \
           ON Eagles.name like Stats.player;"
cur = conn.cursor()
cur.execute(sql)
for row in cur:
    print(row)

(30, '호잉', '외야수', 0.28800000000000003, 58, 15)
(28, '양성우', '외야수', 0.17600000000000002, 6, 1)
(13, '최재훈', '포수', 0.3, 23, 2)
(52, '김태균', '내야수', 0.308, 43, 5)
(7, '송광민', '내야수', 0.257, 39, 6)
(50, '이성열', '내야수', 0.255, 62, 18)
(43, '정은원', '내야수', 0.281, 47, 5)
(8, '정근우', '외야수', 0.21899999999999997, 10, 2)
(25, '최진행', '외야수', 0.184, 14, 3)

In [38]:
sql = "SELECT e.back_no, e.name, e.position, \
           s.average, s.rbi, s.homerun \
           FROM Eagles AS e JOIN Stats AS s \
           ON e.name like s.player;"
cur = conn.cursor()
cur.execute(sql)
rows = cur.fetchall();
columnName = ['등번호', '선수명', '포지션', '타율', '타점', '홈런']
eagles_df = pd.DataFrame(columns = columnName)
for row in rows:
    eagles_df = eagles_df.append(pd.DataFrame([list(row)], columns = columnName), 
                                 ignore_index=True)
eagles_df

  등번호  선수명  포지션     타율  타점  홈런
0  30   호잉  외야수  0.288  58  15
1  28  양성우  외야수  0.176   6   1
2  13  최재훈   포수  0.300  23   2
3  52  김태균  내야수  0.308  43   5
4   7  송광민  내야수  0.257  39   6
5  50  이성열  내야수  0.255  62  18
6  43  정은원  내야수  0.281  47   5
7   8  정근우  외야수  0.219  10   2
8  25  최진행  외야수  0.184  14   3

In [68]:
conn.close()

## 단어 사전 만들기 (숙제)
Line by line : 형태소 > stop word > 단어, 품사, count(will be updated) 테이블 생성 > 저장

 투수들의 기록중에서 평균자책점(ERA), 투구인닝(IP), 탈삼진(SO) 기록을 찾아서 Pitcher_stats 란 테이블을 만들고, Eagles 테이블과 Join 하여 백넘버, 선수명, 포지션, 투구인닝, 평균자책점, 탈삼진 필드를 갖는 데이터 프레임을 만들어서 Join 한 결과를 입력하고, 그 결과를 보이시오.

In [49]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Pitcher_stats \
    (id INT NOT NULL, \
     player TEXT, \
     era REAL, \
     ip REAL, \
     so INT, \
     PRIMARY KEY(id));')

In [51]:
pstats = pd.read_csv('data/pstats.csv', encoding='EUC-KR')
pstats

  player   era    ip  so
0    장민재  4.81  91.2  84
1    안영명  3.43  44.2  35
2    김범수  5.67  81.0  65

In [60]:
cur = conn.cursor()
sql = 'INSERT INTO Pitcher_stats VALUES (?, ?, ?, ?, ?);'
for i in range(3):
    cur.execute(sql, (i+1, 
                      pstats.iloc[i,0],
                      float(pstats.iloc[i,1]), 
                      float(pstats.iloc[i,2]),
                      int(pstats.iloc[i,3])))
conn.commit()

In [63]:
sql = "SELECT e.back_no, e.name, e.position, p.era, p.ip, p.so \
           FROM Eagles AS e \
           JOIN Pitcher_stats AS p \
           ON e.name like p.player;"
cur = conn.cursor()
cur.execute(sql)
rows = cur.fetchall();
columnName = ['등번호', '선수명', '포지션', '평균자책점', '투구이닝', '탈삼진']
eagles_df = pd.DataFrame(columns = columnName)
for row in rows:
    eagles_df = eagles_df.append(pd.DataFrame([list(row)], columns = columnName), 
                                 ignore_index=True)
eagles_df

  등번호  선수명 포지션  평균자책점  투구이닝 탈삼진
0  17  김범수  투수   5.67  81.0  65
1  38  안영명  투수   3.43  44.2  35
2  36  장민재  투수   4.81  91.2  84

국내의 대표적인 걸그룹 또는 보이그룹 5개 이상에 대하여 다음과 같은 정보 를 갖는 테이블을 만드시오.

\*는 Primary Key

id(\*), group_name, 구성원 수, 데뷔일자, 소속사

In [64]:
singers = pd.read_csv('data/singers.csv', encoding='EUC-KR')
singers

    name  member_no       debut company
0  방탄소년단          7  2013-06-13  빅히트 엔터
1    마마무          4  2014-06-19     RBW
2   우주소녀         13  2016-02-25  스타쉽 엔터
3    블락비          7  2011-04-15   KQ 엔터
4     엑소          9  2012-04-08   SM 엔터
5   트와이스          9  2015-10-20  JYP 엔터

In [71]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Singers \
    (id INT NOT NULL, \
     group_name TEXT, \
     member_no INT, \
     debut DATETIME, \
     company TEXT, \
     PRIMARY KEY(id));')

sql = 'INSERT INTO Singers VALUES (?, ?, ?, ?, ?);'
for i in range(6):
    cur.execute(sql, (i+1, 
                      singers.iloc[i,0],
                      int(singers.iloc[i,1]), 
                      singers.iloc[i,2],
                      singers.iloc[i,3]))
conn.commit()

이들이 불렀던 노래 또는 다른 사람이 불렀던 노래 10곡 이상에 대하여 다음 의 정보를 갖는 테이블을 만드시오.

song_id(*), song_name, 그룹 id, 발표년도, 작곡가, 도입부 가사

In [72]:
songs = pd.read_csv('data/songs.csv', encoding='EUC-KR')
songs

,song,gid,year,composer,lyrics
0,작은 것들을 위한 시,1,2019,Pdogg 외,모든 게 궁금해 How’s your day
1,FAKE LOVE,1,2018,Pdogg 외,널 위해서라면 난 슬퍼도 기쁜 척 할 수가 있었어
2,넌 is 뭔들,2,2016,김도훈 외,Hey 거기 미소가 예쁜 남자 바로 너
3,음오아예 (Um Oh Ah Yeh),2,2015,김도훈,oh yes 음 오 아 예 너에게 빠져들겠어 자꾸 반응하잖아
4,HER,4,2014,지코 외,Jesus 무슨 말이 필요해 모두 널 작품이라고 불러
5,으르렁,5,2013,신혁 외,나 으르렁 으르렁 으르렁 대 나 으르렁 으르렁 으르렁 대
6,MAMA,5,2012,유영진,Careless careless Shoot anonymous anonymous
7,CHEER UP,6,2016,블랙아이드필승 외,CHEER UP BABY CHEER UP BABY 좀 더 힘을 내
8,TT,6,2016,블랙아이드필승 외,이런 내 맘 모르고 너무해 너무해
9,빨간 맛,11,2017,Ludwig Lindell 외,빨간 맛 궁금해 Honey 깨물면 점점 녹아든 스트로베리 그 맛

In [74]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Songs \
    (song_id INT NOT NULL, \
     song_name TEXT, \
     gid INT, \
     year INT, \
     composer TEXT, \
     lyrics TEXT, \
     PRIMARY KEY(song_id));')

sql = 'INSERT INTO Songs VALUES (?, ?, ?, ?, ?, ?);'
for i in range(10):
    cur.execute(sql, (i+1, 
                      songs.iloc[i,0],
                      int(songs.iloc[i,1]), 
                      int(songs.iloc[i,2]),
                      songs.iloc[i,3],
                      songs.iloc[i,4]))
conn.commit()

위 두개의 테이블을 조인한 결과를 가지고 다음의 필드를 갖는 데이터 프레임 을 만드시오.

그룹 이름, 구성원 수, 데뷔 일자, 노래 이름, 발표 년도

In [95]:
sql = "SELECT s1.group_name, s1.member_no, s1.debut, s2.song_name, s2.year \
           FROM Songs AS s2 \
           INNER JOIN Singers AS s1 \
           ON s1.id like s2.gid;"
cur = conn.cursor()
cur.execute(sql)
rows = cur.fetchall();
columnName = ['그룹 이름', '구성원 수', '데뷔 일자', '노래 이름', '발표 년도']
singers_df = pd.DataFrame(columns = columnName)
for row in rows:
    singers_df = singers_df.append(pd.DataFrame([list(row)], columns = columnName), 
                                 ignore_index=True)
singers_df

   그룹 이름 구성원 수       데뷔 일자                노래 이름 발표 년도
0  방탄소년단     7  2013-06-13          작은 것들을 위한 시  2019
1  방탄소년단     7  2013-06-13            FAKE LOVE  2018
2    마마무     4  2014-06-19              넌 is 뭔들  2016
3    마마무     4  2014-06-19  음오아예 (Um Oh Ah Yeh)  2015
4    블락비     7  2011-04-15                  HER  2014
5     엑소     9  2012-04-08                  으르렁  2013
6     엑소     9  2012-04-08                 MAMA  2012
7   트와이스     9  2015-10-20             CHEER UP  2016
8   트와이스     9  2015-10-20                   TT  2016

사용자의 이름과, 비밀번호를 갖는 Users 테이블이 있다.

사용자의 이름과 비밀번호를 올바르게 입력하면 ‘성공’을 출력하고, 잘못 입력하면 ‘실패’를 출력하는 프로그램을 작 성하시오.

In [79]:
cur = conn.cursor()
cur.execute('CREATE TABLE IF NOT EXISTS Users \
    (id INT NOT NULL, \
     user_id TEXT, \
     user_pw TEXT, \
     PRIMARY KEY(id));')

sql = 'INSERT INTO Users VALUES (?, ?, ?);'
cur.execute(sql, (1, 'test', 'qwer1234'))

conn.commit()

In [91]:
user_id = input()

test

In [114]:
user_pw = input()

qwer1234

In [92]:
if user_id and user_pw:
    sql = "SELECT count(*) FROM Users WHERE user_id = ? AND user_pw = ?"
    cur = conn.cursor()
    cur.execute(sql, (user_id, user_pw))
    result = cur.fetchone();
    
    if result[0] == 1:
        print("성공")
    else:
        print("실패")

성공

In [96]:
import bcrypt

In [105]:
salt = bcrypt.gensalt()
password = "qwer1234"
hashed = bcrypt.hashpw(password.encode('utf-8'), salt)
print(hashed.decode("utf-8"))

$2b$12$MhgmAqZobEkzeniNBAUej.7e1G/J/QpMyHi8V0hZPFlHnI6JTIJ0.

In [115]:
if user_id and user_pw:
    
    hs_pw = bcrypt.hashpw(user_pw.encode('utf-8'), salt).decode("utf-8")
    sql = "SELECT count(*) FROM Users WHERE user_id = ? AND user_pw = ?"
    cur = conn.cursor()
    cur.execute(sql, (user_id, hs_pw))
    result = cur.fetchone();
    
    if result[0] == 1:
        print("성공")
    else:
        print("실패")

성공